Revit 2027 API
NumberedReferenceInfo Constructor
 Creates a copy of the NumberedReferenceInfo.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public NumberedReferenceInfo(
	NumberedReferenceInfo other
)
Public Sub New (
	other As NumberedReferenceInfo
)
public:
NumberedReferenceInfo(
	NumberedReferenceInfo^ other
)
new :
        other : NumberedReferenceInfo -> NumberedReferenceInfo
Parameters
other NumberedReferenceInfo
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
NumberedReferenceInfo Class
Autodesk.Revit.DB Namespace